/* File menu entry under Import Catalog */
"Media Pro Catalog…" = "Media Pro catalogus...";

/* Error message if failing to launch a Media Pro Catalog for Import */
"Unable to open Media Pro Catalog." = "Kan Media Pro Catalog niet openen.";

/* Error message if failing to get document properties of a Media Pro Catalog for Import */
"Unable to read Media Pro Catalog document properties" = "Kan documenteigenschappen Media Pro catalogus niet lezen";

/* Error message if failing to get item properties in a Media Pro Catalog for Import */
"Unable to read Media Pro Catalog item properties" = "Kan eigenschappen Media Pro catalogus item-eigenschappen niet lezen";

